In [2]:
import pandas as pd

In [3]:
car_sales = pd.read_csv('../car-sales.csv')

In [4]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Creating a New Column with Series

In [5]:
total_fuel_used = pd.Series([4.7, 5.1, 3.6, 9.5, 4.5])
car_sales["Total Fuel Used"] = total_fuel_used

In [6]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  Total Fuel Used
0  Toyota  White         150043      4   $4,000.00              4.7
1   Honda    Red          87899      4   $5,000.00              5.1
2  Toyota   Blue          32549      3   $7,000.00              3.6
3     BMW  Black          11179      5  $22,000.00              9.5
4  Nissan  White         213095      4   $3,500.00              4.5
5  Toyota  Green          99213      4   $4,500.00              NaN
6   Honda   Blue          45698      4   $7,500.00              NaN
7   Honda   Blue          54738      4   $7,000.00              NaN
8  Toyota  White          60000      4   $6,250.00              NaN
9  Nissan  White          31600      4   $9,700.00              NaN

## Filling NaN with mean()

In [7]:
car_sales["Total Fuel Used"] = car_sales["Total Fuel Used"].fillna(car_sales["Total Fuel Used"].mean())

In [8]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  Total Fuel Used
0  Toyota  White         150043      4   $4,000.00             4.70
1   Honda    Red          87899      4   $5,000.00             5.10
2  Toyota   Blue          32549      3   $7,000.00             3.60
3     BMW  Black          11179      5  $22,000.00             9.50
4  Nissan  White         213095      4   $3,500.00             4.50
5  Toyota  Green          99213      4   $4,500.00             5.48
6   Honda   Blue          45698      4   $7,500.00             5.48
7   Honda   Blue          54738      4   $7,000.00             5.48
8  Toyota  White          60000      4   $6,250.00             5.48
9  Nissan  White          31600      4   $9,700.00             5.48

## Creating a New Column with Python List

In [12]:
fuel_capacity = [15.3, 11.2, 9.5, 16.0]
car_sales["Fuel Capacity"] = fuel_capacity

ValueError: Length of values (4) does not match length of index (10)

## Fixing Error
Different from pd.Series, when we are creating a new column using Python Lists, all rows have to be filled

In [15]:
fuel_capacity = [15.3, 11.2, 9.5, 16.0, 11.0, 12.4, 16.6, 18.9, 14.4, 15.6]
car_sales["Fuel Capacity"] = fuel_capacity
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Total Fuel Used,Fuel Capacity
0,Toyota,White,150043,4,"$4,000.00",4.70,15.3
1,Honda,Red,87899,4,"$5,000.00",5.10,11.2
2,Toyota,Blue,32549,3,"$7,000.00",3.60,9.5
3,BMW,Black,11179,5,"$22,000.00",9.50,16.0
4,Nissan,White,213095,4,"$3,500.00",4.50,11.0
5,Toyota,Green,99213,4,"$4,500.00",5.48,12.4
6,Honda,Blue,45698,4,"$7,500.00",5.48,16.6
7,Honda,Blue,54738,4,"$7,000.00",5.48,18.9
8,Toyota,White,60000,4,"$6,250.00",5.48,14.4
9,Nissan,White,31600,4,"$9,700.00",5.48,15.6

## Creating a new Column with a Single Value

In [17]:
total_windows = 6
car_sales["Total Windows"] = total_windows

In [18]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Total Fuel Used,Fuel Capacity,Total Windows
0,Toyota,White,150043,4,"$4,000.00",4.70,15.3,6
1,Honda,Red,87899,4,"$5,000.00",5.10,11.2,6
2,Toyota,Blue,32549,3,"$7,000.00",3.60,9.5,6
3,BMW,Black,11179,5,"$22,000.00",9.50,16.0,6
4,Nissan,White,213095,4,"$3,500.00",4.50,11.0,6
5,Toyota,Green,99213,4,"$4,500.00",5.48,12.4,6
6,Honda,Blue,45698,4,"$7,500.00",5.48,16.6,6
7,Honda,Blue,54738,4,"$7,000.00",5.48,18.9,6
8,Toyota,White,60000,4,"$6,250.00",5.48,14.4,6
9,Nissan,White,31600,4,"$9,700.00",5.48,15.6,6